export const API_URL = "http://localhost:15000";

export const AUTH_MESSAGES = {
  registrationSuccess:
    "Регистрация прошла успешно. Проверьте ваш email для подтверждения.",
  loginSuccess: "Вы успешно вошли в систему.",
  passwordResetSuccess: "Пароль успешно изменён.",
  errorGeneric: "Что-то пошло не так. Попробуйте ещё раз.",
  passwordsDoNotMatch: "Пароли не совпадают.",
  tooManyRequests: "Слишком много запросов. Пожалуйста, подождите.",
};

export const RULES_TEXT = [
  "После регистрации или входа вы можете начать играть.",
  "Регистрация нужна для безопасной а также честной игры.",
  "Прошу ознакомиться с правилами и рекомендациями для игры:",
  "Удерживание (ПКМ, ЛКМ, СКМ) - перемещение по полю, + и - для масштаба.",
  "ЛКМ - оставить пиксель, ПКМ - копировать цвет.",
  "Запрещено: рисовать непристойные надписи и выражения (блокировка), читерство (блокировка).",
  "На данный момент обновление счётчика в реальном времени не работает. После размещения пикселя вы увидите актуальное количество.",
  "Во время бета-тестирования КД пикселей составляет 5 секунд вместо 20.",
];

export const colors = [
  '#000000',
  '#FFFFFF',
  '#808080',
  '#FF0000',
  '#00FF00',
  '#0000FF',
  '#FFFF00',
  '#00ccff',
  '#800080',
  '#ff8800',
];
